torbrodtkorb/alva-master/firmware/pack/edc/AVR64DB48.PIC
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="nn----nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xC3" edc:_addr="0xB8E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="ENRDY" edc:nzwidth="0x1" edc:desc="Enable ready"/>
              <edc:SFRFieldDef edc:cname="CMDRDY" edc:nzwidth="0x1" edc:desc="Command ready"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="PWMACTA" edc:nzwidth="0x1" edc:desc="PWM activity on A"/>
              <edc:SFRFieldDef edc:cname="PWMACTB" edc:nzwidth="0x1" edc:desc="PWM activity on B"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0xB8F"/>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="INPUTCTRLA" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0xB90">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="INPUTMODE" edc:nzwidth="0x4" edc:desc="Input mode">
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Input has no actions" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="JMPWAIT" edc:desc="Stop output, jump to opposite compare cycle and wait" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="EXECWAIT" edc:desc="Stop output, execute opposite compare cycle and wait" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="EXECFAULT" edc:desc="stop output, execute opposite compare cycle while fault active" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="FREQ" edc:desc="Stop all outputs, maintain frequency" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="EXECDT" edc:desc="Stop all outputs, execute dead time while fault active" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="WAIT" edc:desc="Stop all outputs, jump to next compare cycle and wait" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="WAITSW" edc:desc="Stop all outputs, wait for software action" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="EDGETRIG" edc:desc="Stop output on edge, jump to next compare cycle" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="EDGETRIGFREQ" edc:desc="Stop output on edge, maintain frequency" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="LVLTRIGFREQ" edc:desc="Stop output at level, maintain frequency" edc:when="(field &amp; 0xF) == 0x0A"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="INPUTCTRLB" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0xB91">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="INPUTMODE" edc:nzwidth="0x4" edc:desc="Input mode">
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Input has no actions" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="JMPWAIT" edc:desc="Stop output, jump to opposite compare cycle and wait" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="EXECWAIT" edc:desc="Stop output, execute opposite compare cycle and wait" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="EXECFAULT" edc:desc="stop output, execute opposite compare cycle while fault active" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="FREQ" edc:desc="Stop all outputs, maintain frequency" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="EXECDT" edc:desc="Stop all outputs, execute dead time while fault active" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="WAIT" edc:desc="Stop all outputs, jump to next compare cycle and wait" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="WAITSW" edc:desc="Stop all outputs, wait for software action" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="EDGETRIG" edc:desc="Stop output on edge, jump to next compare cycle" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="EDGETRIGFREQ" edc:desc="Stop output on edge, maintain frequency" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="LVLTRIGFREQ" edc:desc="Stop output at level, maintain frequency" edc:when="(field &amp; 0xF) == 0x0A"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="FAULTCTRL" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xB92">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="CMPA" edc:nzwidth="0x1" edc:desc="Compare A value"/>
              <edc:SFRFieldDef edc:cname="CMPB" edc:nzwidth="0x1" edc:desc="Compare B value"/>
              <edc:SFRFieldDef edc:cname="CMPC" edc:nzwidth="0x1" edc:desc="Compare C value"/>
              <edc:SFRFieldDef edc:cname="CMPD" edc:nzwidth="0x1" edc:desc="Compare D vaule"/>
              <edc:SFRFieldDef edc:cname="CMPAEN" edc:nzwidth="0x1" edc:desc="Compare A enable"/>
              <edc:SFRFieldDef edc:cname="CMPBEN" edc:nzwidth="0x1" edc:desc="Compare B enable"/>
              <edc:SFRFieldDef edc:cname="CMPCEN" edc:nzwidth="0x1" edc:desc="Compare C enable"/>
              <edc:SFRFieldDef edc:cname="CMPDEN" edc:nzwidth="0x1" edc:desc="Compare D enable"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0xB93"/>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="DLYCTRL" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:_addr="0xB94">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="DLYSEL" edc:nzwidth="0x2" edc:desc="Delay select">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="No delay" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="INBLANK" edc:desc="Input blanking enabled" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="EVENT" edc:desc="Event delay enabled" edc:when="(field &amp; 0x3) == 0x02"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="DLYTRIG" edc:nzwidth="0x2" edc:desc="Delay trigger">
                <edc:SFRFieldSemantic edc:cname="CMPASET" edc:desc="Compare A set" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="CMPACLR" edc:desc="Compare A clear" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="CMPBSET" edc:desc="Compare B set" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="CMPBCLR" edc:desc="Compare B clear" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="DLYPRESC" edc:nzwidth="0x2" edc:desc="Delay prescaler">
                <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="No prescaling" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Prescale with 2" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Prescale with 4" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Prescale with 8" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="DLYVAL" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xB95">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="DLYVAL" edc:nzwidth="0x8" edc:desc="Delay value"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
